Repository: Just-everyday-developer/Social_Media_Platform
Catalog: lib/l10n/intl_*.arb
Languages: kk

# title
source: My Social Media Platform
kk: Менің әлеуметтік медиа платформам

source: Settings
kk: Параметрлер

source: Home
kk: Басты бет

source: Notifications
kk: Хабарламалар

source: Actions
kk: Әрекеттер

source: Search
kk: Іздеу

source: Profile
kk: Профиль

source: Map
kk: Карта

source: Videos
kk: Видеолар

source: News
kk: Жаңалықтар

source: Cancel
kk: Болдырмау

# main_screen_snackbar
source: Search functionality for posts is not yet integrated with Firebase
kk: Жарияланымдарды іздеу функциясы әлі Firebase-ке біріктірілмеген

# greeting
source: Hello
kk: Сәлем

source: User
kk: Пайдаланушы

source: Login / Sign up
kk: Кіру / Тіркелу

source: Search Location
kk: Орнын іздеу

# address_hint_text
source: Enter address to search
kk: Іздеу үшін мекенжай енгізіңіз

source: Messages
kk: Хабарламалар

source: Dark Theme
kk: Қараңғы режим

# font_size
source: The font size
kk: Қаріп өлшемі

source: Language
kk: Тіл

source: Subscribers
kk: Жазылушылар

source: Answers
kk: Жауаптар

source: Reposts
kk: Репосттар

source: Showing
kk: Көрсетілуде

# more_info
source: Tap for more info
kk: Қосымша ақпарат алу үшін басыңыз

# denied_permissions
source: Location permissions are denied
kk: Орналасу рұқсаттары бас тартылды

# permanently_denied_permissions
source: Location permissions are permanently denied, please enable them in settings
kk: Орналасу рұқсаттары тұрақты түрде бас тартылды, өтінеміз оларды баптаулардан қосыңыз

source: Your Location
kk: Сіздің орныңыз

# search_for_location
source: Search for a location
kk: Орналасуды іздеу

source: You are here
kk: Сіз осындасыз

source: Error getting location
kk: Орналасуды алу қатесі

source: Searched location
kk: Ізделген орын

# not_find_location
source: Could not find location
kk: Орналасуды табу мүмкін болмады

# additional_info
source: This is additional information about this location
kk: Бұл орын туралы қосымша ақпарат

source: Close
kk: Жабу

source: New Location
kk: Жаңа орын

source: Added by tapping
kk: Тию арқылы қосылды

source: Current Address
kk: Ағымдағы мекенжай

source: Enter address to search
kk: Іздеу үшін мекенжай енгізіңіз

# enter_page_error_message
source: Invalid email or password
kk: Жарамсыз электрондық пошта немесе құпиясөз

# enter_page_google_sign_in_error
source: Google sign-in failed
kk: Google арқылы кіру сәтсіз аяқталды

# enter_page_github_sign_in_error
source: Github sign-in failed
kk: GitHub арқылы кіру сәтсіз аяқталды

# successful_login
source: Login Successful!
kk: Кіру сәтті өтті!

source: Welcome Back
kk: Қайтып келгеніңізге қуаныштымыз

# msg_enter_email
source: Please enter your email
kk: Өтінеміз, электрондық поштаңызды енгізіңіз

# msg_enter_valid_email
source: Please enter a valid email
kk: Өтінеміз, жарамды электрондық поштаны енгізіңіз

source: Password
kk: Құпиясөз

# msg_enter_password
source: Please enter your password
kk: Өтінеміз, құпиясөзді енгізіңіз

# msg_enter_long_password
source: Password must be at least 6 characters
kk: Құпиясөз кем дегенде 6 символдан тұруы керек

source: Remember Me
kk: Мені есте сақтау

source: Forgot Password?
kk: Құпиясөзді ұмыттыңыз ба?

source: Log In
kk: Кіру

source: or continue with
kk: немесе мына арқылы жалғастыру

# not_have_account
source: Don't have an account?
kk: Аккаунт жоқ па?

source: Register
kk: Тіркелу

# news_page_title
source: News
kk: Жаңалықтар

# tab_headlines
source: Headlines
kk: Бас хабарлар

# tab_search
source: Search
kk: Іздеу

# tab_categories
source: Categories
kk: Санаттар

# top_headlines_label
source: Top Headlines
kk: Негізгі жаңалықтар

# hint_search_news
source: Search news...
kk: Жаңалықтарды іздеу...

# error_something_wrong
source: Something went wrong
kk: Қате кетті

# button_retry
source: Retry
kk: Қайтадан

source: No articles found
kk: Мақалалар табылмады

# opening_message
source: Opening: {title}
kk: Ашу: {title}

# category_technology
source: Technology
kk: Технология

# category_sports
source: Sports
kk: Спорт

# category_business
source: Business
kk: Бизнес

# category_health
source: Health
kk: Денсаулық

# category_science
source: Science
kk: Ғылым

# category_entertainment
source: Entertainment
kk: Ойын-сауық

# actionsPageTitle
source: Actions
kk: Әрекеттер

# postManagementSectionTitle
source: Post Management
kk: Жазбаларды басқару

# sortPostsCardTitle
source: Sort Posts
kk: Жазбаларды сұрыптау

# sortPostsCardSubtitle
source: Sort posts by date or alphabetically
kk: Жазбаларды күн немесе әліпби бойынша сұрыптау

# quickActionsSectionTitle
source: Quick Actions
kk: Жылдам әрекеттер

# newPostButtonTitle
source: New Post
kk: Жаңа жазба

# searchButtonTitle
source: Search
kk: Іздеу

# refreshButtonTitle
source: Refresh
kk: Жаңарту

# refreshSnackbarMessage
source: Posts are automatically refreshed in real-time
kk: Жазбалар нақты уақытта автоматты түрде жаңартылады

# settingsButtonTitle
source: Settings
kk: Баптаулар

# statisticsSectionTitle
source: Statistics
kk: Статистика

# totalPostsLabel
source: Total Posts
kk: Барлық жазбалар

# totalLikesLabel
source: Total Likes
kk: Барлық ұнатулар

# commentsLabel
source: Comments
kk: Пікірлер

# loadingText
source: Loading...
kk: Жүктелуде...

# footerText
source: Manage your social media experience
kk: Әлеуметтік медиа тәжірибеңізді басқарыңыз

# notificationsTitle
source: Notifications
kk: Хабарламалар

# markAllAsReadTooltip
source: Mark all as read
kk: Барлығын оқылды деп белгілеу

# clearAllMenuItem
source: Clear all
kk: Барлығын тазалау

source: Show unread only
kk: Тек оқылмағандарды көрсету

# totalNotifications
source: Total
kk: Барлығы

# unreadNotifications
source: Unread
kk: Оқылмағандар

# todayNotifications
source: Today
kk: Бүгін

source: No unread notifications
kk: Оқылмаған хабарламалар жоқ

# allCaughtUpMessage
source: All caught up! You have no unread notifications.
kk: Барлығы оқылды! Оқылмаған хабарламаларыңыз жоқ.

source: No notifications yet
kk: Әлі хабарламалар жоқ

# noNotificationsMessage
source: When you receive notifications, they'll appear here.
kk: Хабарламалар келгенде, олар осы жерде пайда болады.

# messageType
source: Message
kk: Хабарлама

# systemType
source: System Update
kk: Жүйе жаңартуы

# reminderType
source: Reminder
kk: Еске салғыш

# promotionType
source: Special Offer
kk: Арнайы ұсыныс

# securityType
source: Security Alert
kk: Қауіпсіздік ескертуі

# welcomeType
source: Welcome
kk: Қош келдіңіз

# timeAgoDays
source: {days}d ago
kk: {days} күн бұрын

# timeAgoHours
source: {hours}h ago
kk: {hours} сағат бұрын

# timeAgoMinutes
source: {minutes}m ago
kk: {minutes} минут бұрын

source: Just now
kk: Дәл қазір

source: Mark as unread
kk: Оқылмаған деп белгілеу

source: Mark as read
kk: Оқылды деп белгілеу

# deleteNotification
source: Delete
kk: Жою

# clearAllNotificationsTitle
source: Clear All Notifications
kk: Барлық хабарламаларды тазалау

# clearAllNotificationsContent
source: Are you sure you want to delete all notifications? This action cannot be undone.
kk: Барлық хабарламаларды жойғыңыз келетініне сенімдісіз бе? Бұл әрекетті болдырмау мүмкін емес.

# cancelButton
source: Cancel
kk: Бас тарту

# clearAllButton
source: Clear All
kk: Барлығын тазалау

# notificationWelcomeTitle
source: Welcome to the app!
kk: Қош келдіңіз!

# notificationWelcomeMessage
source: Thanks for joining us. Explore all the amazing features we have to offer.
kk: Бізге қосылғаныңыз үшін рахмет. Біз ұсынатын барлық таңғажайып мүмкіндіктерді зерттеңіз.

# notificationMessageTitle
source: New message received
kk: Жаңа хабарлама келді

# notificationMessageBody
source: {senderName} sent you a message: "{messageContent}"
kk: {senderName} сізге хабарлама жіберді: "{messageContent}"

# notificationSystemTitle
source: System Update
kk: Жүйе жаңартуы

# notificationSystemMessage
source: Your app has been updated to version {version}. Check out the new features!
kk: Қолданбаңыз {version} нұсқасына жаңартылды. Жаңа мүмкіндіктерді қараңыз!

# notificationReminderTitle
source: Reminder
kk: Еске салғыш

# notificationReminderMessage
source: Don't forget about your meeting at {time} today.
kk: Бүгін сағат {time}-да болатын кездесуіңізді ұмытпаңыз.

# notificationPromotionTitle
source: Special Offer
kk: Арнайы ұсыныс

# notificationPromotionMessage
source: Get {discount}% off on premium subscription. Limited time offer!
kk: Премиум жазылымға {discount}% жеңілдік алыңыз. Ұсыныс шектеулі!

# notificationSecurityTitle
source: Security Alert
kk: Қауіпсіздік ескертуі

# notificationSecurityMessage
source: New login detected from {browser} on {os}. Was this you?
kk: {browser} браузерінен {os} жүйесінде жаңа кіру анықталды. Бұл сіз бе?
